# **PANDAS: INTRODUCTION**
> It is often said that 80% of data analysis is spent on the data cleaning and preparing data. To get a handle on the problem, this section focuses on a small, but important aspect of data manipulation and cleaning with Pandas.
## **Data Structures**
**There are two data structures are there in Pandas -**<br>
* **Series -** It is one-dimensional labeled array capable of holding any data type (integer, strings, floating point numbers, Python objects etc.) of data. The axis is collectively referred to as index.

* **Data Frame -** It is a two-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL Table or a Series of objects.

## **Series Data Structure:**
**pandas.core.series.Series(data, index, dtype, copy)**<br>
* **data -** data takes various forms like ndarray, list, constants, dictionary etc.<br>
* **index -** it is unique and hashable for easy identification.<br>
* **dtype -** it is for data type.<br>
* **copy -** copy data, and its default value is False. It only affects for Series or one dimensional ndarray inputs.

In [83]:
# importing required modules
import pandas as pd
import numpy as np

In [84]:
# creating empty Series
import warnings
warnings.filterwarnings('ignore')
s = pd.Series()
print (s, type(s))

Series([], dtype: float64) <class 'pandas.core.series.Series'>

In [85]:
# create a Series from a ndarray
arr_data = np.array(['apple', 'banana', 'cherry', 'pineapple'])
print (arr_data, type(arr_data))
s = pd.Series(data = arr_data)
print (s)
print (type(s), s[0], s[3])

['apple' 'banana' 'cherry' 'pineapple'] <class 'numpy.ndarray'>
0        apple
1       banana
2       cherry
3    pineapple
dtype: object
<class 'pandas.core.series.Series'> apple pineapple

In [86]:
arr_data = np.array([100, 300, 200, 600, 500])
print (arr_data, type(arr_data))
s = pd.Series(data = arr_data, copy = False)
print (s)
s[0] = 999; arr_data[2] = 888
print (arr_data, type(arr_data))
print (s)

[100 300 200 600 500] <class 'numpy.ndarray'>
0    100
1    300
2    200
3    600
4    500
dtype: int32
[999 300 888 600 500] <class 'numpy.ndarray'>
0    999
1    300
2    888
3    600
4    500
dtype: int32

In [87]:
arr_data = np.array([100, 300, 200, 600, 500])
print (arr_data, type(arr_data))
s = pd.Series(data = arr_data, copy = True)
print (s)
s[0] = 999; arr_data[2] = 888
print (arr_data, type(arr_data))
print (s)

[100 300 200 600 500] <class 'numpy.ndarray'>
0    100
1    300
2    200
3    600
4    500
dtype: int32
[100 300 888 600 500] <class 'numpy.ndarray'>
0    999
1    300
2    200
3    600
4    500
dtype: int32

In [88]:
arr_data = np.array(['apple', 'banana', 'cherry', 'pineapple'])
print (arr_data, type(arr_data))

s = pd.Series(data = arr_data, index = [100, 101, 102, 103])
print (s)
print (s[100], type(s[100]), s[103], type(s[103]))

s = pd.Series(data = arr_data, index = [100, 101, 100, 103])
print (s)
print (s[100], type(s[100]))
print (s[103], type(s[103]))

['apple' 'banana' 'cherry' 'pineapple'] <class 'numpy.ndarray'>
100        apple
101       banana
102       cherry
103    pineapple
dtype: object
apple <class 'str'> pineapple <class 'str'>
100        apple
101       banana
100       cherry
103    pineapple
dtype: object
100     apple
100    cherry
dtype: object <class 'pandas.core.series.Series'>
pineapple <class 'str'>

In [89]:
arr_data = np.array(['apple', 'banana', 'cherry', 'pineapple'])
s = pd.Series(data = arr_data, index = ['fruit-1', 'fruit-2', 'fruit-3', 'fruit-4'])
print (s)
print (s['fruit-1'], s[0], s['fruit-3'], s[2])

fruit-1        apple
fruit-2       banana
fruit-3       cherry
fruit-4    pineapple
dtype: object
apple apple cherry cherry

In [90]:
# create a Series from a dictionary
dict_data = {'apple':100, 'banana':202, 'coconut':450, 'mango':435}
print (dict_data)
s = pd.Series(dict_data)
print (s)
s = pd.Series(dict_data, index = ['banana', 'mango', 'apple', 'coconut'])
print (s)
s = pd.Series(dict_data, index = ['banana', 'mango', 'apple', 'coconut', 'lime'])
print (s)
print (s[0], s[2])

{'apple': 100, 'banana': 202, 'coconut': 450, 'mango': 435}
apple      100
banana     202
coconut    450
mango      435
dtype: int64
banana     202
mango      435
apple      100
coconut    450
dtype: int64
banana     202.0
mango      435.0
apple      100.0
coconut    450.0
lime         NaN
dtype: float64
202.0 100.0

In [91]:
# create a Series from a scalar
s = pd.Series(data = 5, index = [0, 1, 2, 3, 4])
print (s)
s = pd.Series(5, index = [0, 1, 2, 0, 1, 2])
print (s)
print (s[0])

0    5
1    5
2    5
3    5
4    5
dtype: int64
0    5
1    5
2    5
0    5
1    5
2    5
dtype: int64
0    5
0    5
dtype: int64

In [92]:
# Create a Series from a list
s = pd.Series(data = [101, 303, 202, 404, 505], index = ['red', 'blue', 'brown', 'black', 'silver'])
print (s)
print (s['blue'], s[1])
print ()
print (s[0:4])
print ()
print (s[-5:-1])

red       101
blue      303
brown     202
black     404
silver    505
dtype: int64
303 303

red      101
blue     303
brown    202
black    404
dtype: int64

red      101
blue     303
brown    202
black    404
dtype: int64

In [93]:
print (s[['brown', 'red', 'silver', 'blue']])

brown     202
red       101
silver    505
blue      303
dtype: int64

In [94]:
print (s.sort_values())

red       101
brown     202
blue      303
black     404
silver    505
dtype: int64

In [95]:
print (s.sort_index())

black     404
blue      303
brown     202
red       101
silver    505
dtype: int64

In [96]:
print (s)
print (s.argmin(), s.argmax(), s.count())
print (s.min(), s.max(), s.mean(), s.sum(), len(s))

red       101
blue      303
brown     202
black     404
silver    505
dtype: int64
0 4 5
101 505 303.0 1515 5

## **Data Frame Data Structure:**

### **Create DataFrame**

In [97]:
data_dict = {'emp_name':['Amal', 'Kamal', 'Bimal', 'Shyamal'], 'emp_age':[34, 35, 45, 43]}
print (data_dict)
emp_id = [100, 101, 102, 103]
df = pd.DataFrame(data = data_dict, index = emp_id)
df

{'emp_name': ['Amal', 'Kamal', 'Bimal', 'Shyamal'], 'emp_age': [34, 35, 45, 43]}

    emp_name  emp_age
100     Amal       34
101    Kamal       35
102    Bimal       45
103  Shyamal       43

In [98]:
df.reset_index(inplace=True)
print (df)
df

   index emp_name  emp_age
0    100     Amal       34
1    101    Kamal       35
2    102    Bimal       45
3    103  Shyamal       43

   index emp_name  emp_age
0    100     Amal       34
1    101    Kamal       35
2    102    Bimal       45
3    103  Shyamal       43

### **Creating user1, user2, user3**

In [99]:
user_data = [['alice', 19, 'F', 'student'], ['john', 26, 'M', 'student']]
user_columns = ['name', 'age', 'gender', 'job']
user1 = pd.DataFrame(data = user_data, columns = user_columns)
user1

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student

In [100]:
user_data = dict(name = ['eric', 'paul'], age = [22, 58], gender = ['M', 'F'], job = ['student', 'manager'])
print (user_data)
user2 = pd.DataFrame(data = user_data)
user2

{'name': ['eric', 'paul'], 'age': [22, 58], 'gender': ['M', 'F'], 'job': ['student', 'manager']}

   name  age gender      job
0  eric   22      M  student
1  paul   58      F  manager

In [101]:
user_data = {'name': ['peter', 'julie'], 'age': [33, 44], 'gender': ['M', 'F'], 'job': ['engineer', 'scientist']}
print (user_data)
user3 = pd.DataFrame(data = user_data)
user3

{'name': ['peter', 'julie'], 'age': [33, 44], 'gender': ['M', 'F'], 'job': ['engineer', 'scientist']}

    name  age gender        job
0  peter   33      M   engineer
1  julie   44      F  scientist

### **Concatenate DataFrame**

In [102]:
users = user1.append(user2)
users

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
0   eric   22      M  student
1   paul   58      F  manager

In [103]:
users = user1.append(user2, ignore_index = True)
users

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
2   eric   22      M  student
3   paul   58      F  manager

In [104]:
users = users.append(user3, ignore_index=True)
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [105]:
users = user1.append(user2).append(user3, ignore_index = True)
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [106]:
users = pd.concat([user1, user2, user3])
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
0   eric   22      M    student
1   paul   58      F    manager
0  peter   33      M   engineer
1  julie   44      F  scientist

In [107]:
users = pd.concat([user1, user2, user3], ignore_index=True)
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

## **DataFrame to NumPy ndarray**

In [108]:
arr_data = user1[['name', 'job']].to_numpy()
print (arr_data, type(arr_data))

[['alice' 'student']
 ['john' 'student']] <class 'numpy.ndarray'>

In [109]:
arr_data = user1.to_numpy()
print (arr_data, type(arr_data))

[['alice' 19 'F' 'student']
 ['john' 26 'M' 'student']] <class 'numpy.ndarray'>

In [110]:
arr_data = np.array(user1)
print (arr_data, type(arr_data))

[['alice' 19 'F' 'student']
 ['john' 26 'M' 'student']] <class 'numpy.ndarray'>

## **Join DataFrame**

In [111]:
dict_data = dict(name = ['alice', 'john', 'eric', 'julie', 'anderson'], height = [165, 180, 175, 171, 169])
print (dict_data)
user4 = pd.DataFrame(data = dict_data)
user4

{'name': ['alice', 'john', 'eric', 'julie', 'anderson'], 'height': [165, 180, 175, 171, 169]}

       name  height
0     alice     165
1      john     180
2      eric     175
3     julie     171
4  anderson     169

In [112]:
# inner join: All common rows from both data frames
merge_inner = pd.merge(users, user4, on = "name", how = "inner")
merge_inner

    name  age gender        job  height
0  alice   19      F    student     165
1   john   26      M    student     180
2   eric   22      M    student     175
3  julie   44      F  scientist     171

In [113]:
# inner join: All matching rows from both data frames
merge_inner = pd.merge(users, user4, on = "name")
merge_inner  # by default inner join will take place

    name  age gender        job  height
0  alice   19      F    student     165
1   john   26      M    student     180
2   eric   22      M    student     175
3  julie   44      F  scientist     171

In [114]:
# outer join: All rows from both data frames
merge_outer = pd.merge(users, user4, on = "name", how = "outer")
merge_outer

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      john  26.0      M    student   180.0
2      eric  22.0      M    student   175.0
3      paul  58.0      F    manager     NaN
4     peter  33.0      M   engineer     NaN
5     julie  44.0      F  scientist   171.0
6  anderson   NaN    NaN        NaN   169.0

In [115]:
# left outer join: All rows from the left data frame and matching rows from the right data frame
merge_left = pd.merge(users, user4, on = "name", how = "left")
merge_left

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
3   paul   58      F    manager     NaN
4  peter   33      M   engineer     NaN
5  julie   44      F  scientist   171.0

In [116]:
# right outer join: Only matching rows from the left data frame and all rows from the right data frame
merge_right = pd.merge(users, user4, on = "name", how = "right")
merge_right

       name   age gender        job  height
0     alice  19.0      F    student     165
1      john  26.0      M    student     180
2      eric  22.0      M    student     175
3     julie  44.0      F  scientist     171
4  anderson   NaN    NaN        NaN     169

## **Summarizing**

In [117]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [118]:
users.head()

    name  age gender       job
0  alice   19      F   student
1   john   26      M   student
2   eric   22      M   student
3   paul   58      F   manager
4  peter   33      M  engineer

In [119]:
users.head(3)

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
2   eric   22      M  student

In [120]:
users.tail()

    name  age gender        job
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [121]:
users.tail(3)

    name  age gender        job
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [122]:
users.any()

name      True
age       True
gender    True
job       True
dtype: bool

In [123]:
users.sample()

    name  age gender        job
5  julie   44      F  scientist

In [124]:
users.sample(3)

    name  age gender        job
1   john   26      M    student
5  julie   44      F  scientist
2   eric   22      M    student

In [125]:
print(users.index)
print(users.columns)
print(users.dtypes)
print(type(users.dtypes))

RangeIndex(start=0, stop=6, step=1)
Index(['name', 'age', 'gender', 'job'], dtype='object')
name      object
age        int64
gender    object
job       object
dtype: object
<class 'pandas.core.series.Series'>

In [126]:
print(users.shape)
print(f"Number of rows = {users.shape[0]} and number of columns = {users.shape[1]}")

(6, 4)
Number of rows = 6 and number of columns = 4

In [127]:
print (users.values)
print (type(users.values), users.values.shape, users.values.ndim, users.values.size)

[['alice' 19 'F' 'student']
 ['john' 26 'M' 'student']
 ['eric' 22 'M' 'student']
 ['paul' 58 'F' 'manager']
 ['peter' 33 'M' 'engineer']
 ['julie' 44 'F' 'scientist']]
<class 'numpy.ndarray'> (6, 4) 2 24

In [128]:
print (users.job.value_counts())
print (users.gender.value_counts())

student      3
manager      1
engineer     1
scientist    1
Name: job, dtype: int64
F    3
M    3
Name: gender, dtype: int64

In [129]:
users.describe().T

     count       mean        std   min   25%   50%    75%   max
age    6.0  33.666667  14.895189  19.0  23.0  29.5  41.25  58.0

In [130]:
users.describe(include = 'all').transpose()

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
name,6,6,alice,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
age,6.0,NaN,NaN,NaN,33.666667,14.895189,19.0,23.0,29.5,41.25,58.0
gender,6,2,F,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN
job,6,4,student,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [131]:
users.describe(include = 'object').transpose()

       count unique      top freq
name       6      6    alice    1
gender     6      2        F    3
job        6      4  student    3

In [132]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     6 non-null      int64
 2   gender  6 non-null      object
 3   job     6 non-null      object
dtypes: int64(1), object(3)
memory usage: 320.0+ bytes

In [133]:
print(users)

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

## **Column Selection**

In [134]:
users.job

0      student
1      student
2      student
3      manager
4     engineer
5    scientist
Name: job, dtype: object

In [135]:
users['job']

0      student
1      student
2      student
3      manager
4     engineer
5    scientist
Name: job, dtype: object

In [136]:
users[['job']]

         job
0    student
1    student
2    student
3    manager
4   engineer
5  scientist

In [137]:
users[['job', 'name']]

         job   name
0    student  alice
1    student   john
2    student   eric
3    manager   paul
4   engineer  peter
5  scientist  julie

In [138]:
my_cols = ['age', 'job']
users[my_cols]

   age        job
0   19    student
1   26    student
2   22    student
3   58    manager
4   33   engineer
5   44  scientist

## **Row Selection**

In [139]:
df = users.copy()
print (df.iloc[3], type(df.iloc[3]))
print ()
print (df.loc[3], type(df.loc[3]))

name         paul
age            58
gender          F
job       manager
Name: 3, dtype: object <class 'pandas.core.series.Series'>

name         paul
age            58
gender          F
job       manager
Name: 3, dtype: object <class 'pandas.core.series.Series'>

In [140]:
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [141]:
print (df.iloc[4][3], df.iloc[4]['job'], df.loc[4][3], df.loc[4]['job'])
print (df.iloc[4, 3], df.iloc[4]['job'], df.loc[4][3], df.loc[4, 'job'])
print (df.shape, len(df), df.ndim, df.size)

engineer engineer engineer engineer
engineer engineer engineer engineer
(6, 4) 6 2 24

In [142]:
print (merge_outer.size, merge_outer.shape)
merge_outer

35 (7, 5)

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      john  26.0      M    student   180.0
2      eric  22.0      M    student   175.0
3      paul  58.0      F    manager     NaN
4     peter  33.0      M   engineer     NaN
5     julie  44.0      F  scientist   171.0
6  anderson   NaN    NaN        NaN   169.0

In [143]:
# increasing all age values by 100
df = users.copy()
for i in range(df.shape[0]):
    current_row = df.iloc[i].copy()
    current_row.age += 100
    df.iloc[i] = current_row
df

    name  age gender        job
0  alice  119      F    student
1   john  126      M    student
2   eric  122      M    student
3   paul  158      F    manager
4  peter  133      M   engineer
5  julie  144      F  scientist

## **Row Selection and Filtering**

In [144]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [145]:
print (users.age < 40)
print (type(users.age < 40))
users[users.age < 40]

0     True
1     True
2     True
3    False
4     True
5    False
Name: age, dtype: bool
<class 'pandas.core.series.Series'>

    name  age gender       job
0  alice   19      F   student
1   john   26      M   student
2   eric   22      M   student
4  peter   33      M  engineer

In [146]:
print (~(users.age < 40))  # ~ denotes negation
print (type(~(users.age < 40)))
users[~(users.age < 40)]

0    False
1    False
2    False
3     True
4    False
5     True
Name: age, dtype: bool
<class 'pandas.core.series.Series'>

    name  age gender        job
3   paul   58      F    manager
5  julie   44      F  scientist

In [147]:
users[users.age < 40].job

0     student
1     student
2     student
4    engineer
Name: job, dtype: object

In [148]:
users[users.age < 40]['job']

0     student
1     student
2     student
4    engineer
Name: job, dtype: object

In [149]:
users[users.age < 40][['job']]

        job
0   student
1   student
2   student
4  engineer

In [150]:
# SQL Query: select job, gender and name from users where age < 40;
users[users.age < 40][['job', 'gender', 'name']]

        job gender   name
0   student      F  alice
1   student      M   john
2   student      M   eric
4  engineer      M  peter

In [151]:
print((users.age > 30) & (users.gender == 'F'))

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

In [152]:
users[(users.age > 30) & (users.gender == 'F')]

    name  age gender        job
3   paul   58      F    manager
5  julie   44      F  scientist

In [153]:
users[(users.age > 30) & (users.gender == 'F')][['name', 'job', 'gender']]

    name        job gender
3   paul    manager      F
5  julie  scientist      F

In [154]:
users[(users.job == "engineer") | (users.job == 'student')][['name', 'job', 'gender', 'age']]

    name       job gender  age
0  alice   student      F   19
1   john   student      M   26
2   eric   student      M   22
4  peter  engineer      M   33

In [155]:
users[users.job.isin(["engineer", 'student'])][['name', 'job', 'gender', 'age']]

    name       job gender  age
0  alice   student      F   19
1   john   student      M   26
2   eric   student      M   22
4  peter  engineer      M   33

## **Sorting**

In [156]:
df = users.copy()
print (df)
df.age.sort_values()

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

0    19
2    22
1    26
4    33
5    44
3    58
Name: age, dtype: int64

In [157]:
df.age.sort_values(ignore_index=True)

0    19
1    22
2    26
3    33
4    44
5    58
Name: age, dtype: int64

In [158]:
df.sort_values(by = 'age', inplace=True, ignore_index=True)
df

    name  age gender        job
0  alice   19      F    student
1   eric   22      M    student
2   john   26      M    student
3  peter   33      M   engineer
4  julie   44      F  scientist
5   paul   58      F    manager

In [159]:
df = users.copy()
df = df.sort_values(by = 'age', ascending = False, ignore_index=True)
df

    name  age gender        job
0   paul   58      F    manager
1  julie   44      F  scientist
2  peter   33      M   engineer
3   john   26      M    student
4   eric   22      M    student
5  alice   19      F    student

In [160]:
df = users.copy()
df.sort_values(by = 'age', ascending = False, ignore_index=True, inplace=True)
df

    name  age gender        job
0   paul   58      F    manager
1  julie   44      F  scientist
2  peter   33      M   engineer
3   john   26      M    student
4   eric   22      M    student
5  alice   19      F    student

## **Unpivoting and Pivoting**

**Unpivot ->**  Wide format (Unstacked Format) to Long format (Stacked Format)<br>
**Pivot ->**    Long format (Stacked Format) to Wide format (Unstacked Format)

In [161]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [162]:
# performing the unpivot operation: Wide format to Long format
stacked = pd.melt(users, id_vars = "name", var_name = "variable", value_name = "value");
stacked

     name variable      value
0   alice      age         19
1    john      age         26
2    eric      age         22
3    paul      age         58
4   peter      age         33
5   julie      age         44
6   alice   gender          F
7    john   gender          M
8    eric   gender          M
9    paul   gender          F
10  peter   gender          M
11  julie   gender          F
12  alice      job    student
13   john      job    student
14   eric      job    student
15   paul      job    manager
16  peter      job   engineer
17  julie      job  scientist

In [163]:
unstacked = stacked.pivot(index = 'name', columns = "variable", values = "value");
unstacked

variable age gender        job
name
alice     19      F    student
eric      22      M    student
john      26      M    student
julie     44      F  scientist
paul      58      F    manager
peter     33      M   engineer

In [164]:
unstacked.reset_index(inplace=True)
unstacked.columns.name = ""
unstacked

    name age gender        job
0  alice  19      F    student
1   eric  22      M    student
2   john  26      M    student
3  julie  44      F  scientist
4   paul  58      F    manager
5  peter  33      M   engineer

## **Quality Control: Duplicate Data**

In [165]:
df = users.copy()
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [166]:
df = df.append(df.iloc[0])
df = df.append(df.iloc[2])
df = df.append(df.iloc[4])
df = df.append(df.iloc[3], ignore_index=True)

In [167]:
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist
6  alice   19      F    student
7   eric   22      M    student
8  peter   33      M   engineer
9   paul   58      F    manager

In [168]:
df.sort_values(by = "name", inplace = True)
df.index = range(0, df.shape[0])
df

    name  age gender        job
0  alice   19      F    student
1  alice   19      F    student
2   eric   22      M    student
3   eric   22      M    student
4   john   26      M    student
5  julie   44      F  scientist
6   paul   58      F    manager
7   paul   58      F    manager
8  peter   33      M   engineer
9  peter   33      M   engineer

In [169]:
print (df.duplicated().sum())
df.duplicated()

4

0    False
1     True
2    False
3     True
4    False
5    False
6    False
7     True
8    False
9     True
dtype: bool

In [171]:
print ((~df.duplicated()).sum())
~df.duplicated()

6

0     True
1    False
2     True
3    False
4     True
5     True
6     True
7    False
8     True
9    False
dtype: bool

In [172]:
df[df.duplicated()]

    name  age gender       job
1  alice   19      F   student
3   eric   22      M   student
7   paul   58      F   manager
9  peter   33      M  engineer

In [173]:
df[~df.duplicated()]

    name  age gender        job
0  alice   19      F    student
2   eric   22      M    student
4   john   26      M    student
5  julie   44      F  scientist
6   paul   58      F    manager
8  peter   33      M   engineer

In [175]:
print (df.job.duplicated())
df[df.job.duplicated()]

0    False
1     True
2     True
3     True
4     True
5    False
6    False
7     True
8    False
9     True
Name: job, dtype: bool

    name  age gender       job
1  alice   19      F   student
2   eric   22      M   student
3   eric   22      M   student
4   john   26      M   student
7   paul   58      F   manager
9  peter   33      M  engineer

In [176]:
print (df.duplicated(['job', 'gender']).sum())
df.duplicated(['job', 'gender'])

5

0    False
1     True
2    False
3     True
4     True
5    False
6    False
7     True
8    False
9     True
dtype: bool

In [178]:
df.drop_duplicates(inplace = True)
df.index = range(0, df.shape[0])
df

    name  age gender        job
0  alice   19      F    student
1   eric   22      M    student
2   john   26      M    student
3  julie   44      F  scientist
4   paul   58      F    manager
5  peter   33      M   engineer

## **Quality Control: Missing Data**

In [180]:
df = merge_left.copy()    # NaN means Not a number
df

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
3   paul   58      F    manager     NaN
4  peter   33      M   engineer     NaN
5  julie   44      F  scientist   171.0

In [182]:
df.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
name,6,6,alice,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
age,6.0,NaN,NaN,NaN,33.666667,14.895189,19.0,23.0,29.5,41.25,58.0
gender,6,2,F,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN
job,6,4,student,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN
height,4.0,NaN,NaN,NaN,172.75,6.344289,165.0,169.5,173.0,176.25,180.0

In [183]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     6 non-null      int64
 2   gender  6 non-null      object
 3   job     6 non-null      object
 4   height  4 non-null      float64
dtypes: float64(1), int64(1), object(3)
memory usage: 288.0+ bytes

In [185]:
print (df.height.isnull().sum())
print (df.height.isnull())
df[df.height.isnull()]

2
0    False
1    False
2    False
3     True
4     True
5    False
Name: height, dtype: bool

    name  age gender       job  height
3   paul   58      F   manager     NaN
4  peter   33      M  engineer     NaN

In [186]:
print (df.height.notnull().sum())
print (df.height.notnull())
df[df.height.notnull()]

4
0     True
1     True
2     True
3    False
4    False
5     True
Name: height, dtype: bool

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
5  julie   44      F  scientist   171.0

In [187]:
df.isnull()

    name    age  gender    job  height
0  False  False   False  False   False
1  False  False   False  False   False
2  False  False   False  False   False
3  False  False   False  False    True
4  False  False   False  False    True
5  False  False   False  False   False

In [188]:
df.notnull()

   name   age  gender   job  height
0  True  True    True  True    True
1  True  True    True  True    True
2  True  True    True  True    True
3  True  True    True  True   False
4  True  True    True  True   False
5  True  True    True  True    True

In [189]:
# Strategy - 1: (Deleting rows containing missing values)
df = merge_outer.copy()
df.dropna(inplace = True)    # delete that row which is having null value in any column
df

    name   age gender        job  height
0  alice  19.0      F    student   165.0
1   john  26.0      M    student   180.0
2   eric  22.0      M    student   175.0
5  julie  44.0      F  scientist   171.0

In [190]:
df = merge_outer.copy()
df.dropna(how = "all", inplace = True)   # delete that row which is having null value in all columns
df

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      john  26.0      M    student   180.0
2      eric  22.0      M    student   175.0
3      paul  58.0      F    manager     NaN
4     peter  33.0      M   engineer     NaN
5     julie  44.0      F  scientist   171.0
6  anderson   NaN    NaN        NaN   169.0

In [191]:
# Strategy - 2: (Filling up missing values)
df = merge_outer.copy()
df.fillna(0, inplace = True)    # filling with 0 value
df

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      john  26.0      M    student   180.0
2      eric  22.0      M    student   175.0
3      paul  58.0      F    manager     0.0
4     peter  33.0      M   engineer     0.0
5     julie  44.0      F  scientist   171.0
6  anderson   0.0      0          0   169.0

In [192]:
df = merge_outer.copy()
mean_height = df.height.mean()
print (mean_height)
df.fillna(mean_height, inplace = True)    # filling with 0 value
df

172.0

       name    age gender        job  height
0     alice   19.0      F    student   165.0
1      john   26.0      M    student   180.0
2      eric   22.0      M    student   175.0
3      paul   58.0      F    manager   172.0
4     peter   33.0      M   engineer   172.0
5     julie   44.0      F  scientist   171.0
6  anderson  172.0  172.0      172.0   169.0

In [193]:
df = merge_outer.copy()
df.sort_values(by = 'age', inplace = True)
df.index = range(0, df.shape[0])
df

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      eric  22.0      M    student   175.0
2      john  26.0      M    student   180.0
3     peter  33.0      M   engineer     NaN
4     julie  44.0      F  scientist   171.0
5      paul  58.0      F    manager     NaN
6  anderson   NaN    NaN        NaN   169.0

In [194]:
df.fillna(method = 'pad', inplace = True)    # forward fill
df

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      eric  22.0      M    student   175.0
2      john  26.0      M    student   180.0
3     peter  33.0      M   engineer   180.0
4     julie  44.0      F  scientist   171.0
5      paul  58.0      F    manager   171.0
6  anderson  58.0      F    manager   169.0

In [195]:
df = merge_outer.copy()
df.sort_values(by = 'age', inplace = True)
df.index = range(0, df.shape[0])
df

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      eric  22.0      M    student   175.0
2      john  26.0      M    student   180.0
3     peter  33.0      M   engineer     NaN
4     julie  44.0      F  scientist   171.0
5      paul  58.0      F    manager     NaN
6  anderson   NaN    NaN        NaN   169.0

In [196]:
df.fillna(method = 'bfill', inplace = True)    # backward fill
df

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      eric  22.0      M    student   175.0
2      john  26.0      M    student   180.0
3     peter  33.0      M   engineer   171.0
4     julie  44.0      F  scientist   171.0
5      paul  58.0      F    manager   169.0
6  anderson   NaN    NaN        NaN   169.0

## **Rename Column Names**

In [199]:
df = users.copy()
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [201]:
df = df.rename(columns = {'name':'emp_name', 'age':'emp_age', 'gender':'emp_gender','job':'emp_job'});
df

  emp_name  emp_age emp_gender    emp_job
0    alice       19          F    student
1     john       26          M    student
2     eric       22          M    student
3     paul       58          F    manager
4    peter       33          M   engineer
5    julie       44          F  scientist

In [203]:
df = users.copy()
print (df.columns)
new_column_names = ['emp_name', 'emp_age', 'emp_gender', 'emp_job']
df.columns = new_column_names
df

Index(['name', 'age', 'gender', 'job'], dtype='object')

  emp_name  emp_age emp_gender    emp_job
0    alice       19          F    student
1     john       26          M    student
2     eric       22          M    student
3     paul       58          F    manager
4    peter       33          M   engineer
5    julie       44          F  scientist

## **Groupby on DataFrame**

In [204]:
df = users.copy()
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [206]:
for group, data_frame in users.groupby("job"):
    print (type(group), type(data_frame))
    print ("Group name:", group)
    print (data_frame)

<class 'str'> <class 'pandas.core.frame.DataFrame'>
Group name: engineer
    name  age gender       job
4  peter   33      M  engineer
<class 'str'> <class 'pandas.core.frame.DataFrame'>
Group name: manager
   name  age gender      job
3  paul   58      F  manager
<class 'str'> <class 'pandas.core.frame.DataFrame'>
Group name: scientist
    name  age gender        job
5  julie   44      F  scientist
<class 'str'> <class 'pandas.core.frame.DataFrame'>
Group name: student
    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
2   eric   22      M  student

In [207]:
for group, data_frame in users.groupby("gender"):
    print (type(group), type(data_frame))
    print ("Group name:", group)
    print (data_frame)

<class 'str'> <class 'pandas.core.frame.DataFrame'>
Group name: F
    name  age gender        job
0  alice   19      F    student
3   paul   58      F    manager
5  julie   44      F  scientist
<class 'str'> <class 'pandas.core.frame.DataFrame'>
Group name: M
    name  age gender       job
1   john   26      M   student
2   eric   22      M   student
4  peter   33      M  engineer

In [209]:
grouped_df = df.groupby('job').agg({'age':['sum', 'mean', 'max', 'min'], 'gender': 'count'});
print (grouped_df)

          age                    gender
          sum       mean max min  count
job
engineer   33  33.000000  33  33      1
manager    58  58.000000  58  58      1
scientist  44  44.000000  44  44      1
student    67  22.333333  26  19      3

In [210]:
grouped_df = df.groupby('gender').agg({'age':['sum', 'mean', 'max', 'min'], 'gender': ['count']});
print (grouped_df)

        age                    gender
        sum       mean max min  count
gender
F       121  40.333333  58  19      3
M        81  27.000000  33  22      3

## **Reading Data on DataFrame from External Sources**

In [222]:
try:
    print ("Reading data from the .CSV file...")
    # df = pd.read_csv("salary_table.csv")
    # df = pd.read_csv("./salary_table.csv")
    # df = pd.read_csv("C:\\Users\Arnab\CMOS\salary_table.csv")
    # df = pd.read_csv("C:\\Users\\Arnab\\CMOS\\salary_table.csv")
    # df = pd.read_csv("C:/Users/Arnab/CMOS/salary_table.csv")
    # df = pd.read_csv("C://Users//Arnab//CMOS//salary_table.csv")
    df = pd.read_csv("C://Users/Arnab\CMOS\\salary_table.csv")
except:
    print ("File access error !!!")
    print ("Data file could not be read successfully...")
    
df.head()

Reading data from the .CSV file...

   salary  experience education management
0   13876           1  Bachelor          Y
1   11608           1      Ph.D          N
2   18701           1      Ph.D          Y
3   11283           1    Master          N
4   11767           1      Ph.D          N

In [223]:
try:
    print ("Reading data from the .XLSX file...")
    df = pd.read_excel("./Online Retail.xlsx")
except:
    print ("File access error !!!")
    print ("Data file could not be read successfully...")
    
df.head()

Reading data from the .XLSX file...

,INVOICENO,STOCKCODE,DESCRIPTION,QUANTITY,INVOICEDATE,UNITPRICE,CUSTOMERID,COUNTRY
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850,United Kingdom
4,536403,22867,HAND WARMER BIRD DESIGN,96,2010-12-01 11:27:00,1.85,12791,Netherlands

In [224]:
try:
    print ("Reading data from the .XLSX file...")
    df = pd.read_excel("./Online Retail.xlsx", sheet_name="Sheet1")
except:
    print ("File access error !!!")
    print ("Data file could not be read successfully...")
    
df.head()

Reading data from the .XLSX file...

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850,United Kingdom
4,536403,22867,HAND WARMER BIRD DESIGN,96,2010-12-01 11:27:00,1.85,12791,Netherlands

In [226]:
try:
    print ("Reading data from the .XLSX file...")
    df = pd.read_excel("./Online Retail.xlsx", sheet_name="Sheet2")
except:
    print ("File access error !!!")
    print ("Data file could not be read successfully...")
    
df.head()

Reading data from the .XLSX file...

,INVOICENO,STOCKCODE,DESCRIPTION,QUANTITY,INVOICEDATE,UNITPRICE,CUSTOMERID,COUNTRY
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850,United Kingdom
4,536403,22867,HAND WARMER BIRD DESIGN,96,2010-12-01 11:27:00,1.85,12791,Netherlands

## **Insert and Delete Columns and Replace Column Values**

In [231]:
df1 = df.copy()
df1 = df1[["INVOICENO", "UNITPRICE", "CUSTOMERID", "COUNTRY"]]
print (df1.shape)
df1.head()

(15, 4)

   INVOICENO  UNITPRICE  CUSTOMERID         COUNTRY
0     536365       2.55       17850  United Kingdom
1     536365       3.39       17850  United Kingdom
2     536365       2.75       17850  United Kingdom
3     536365       3.39       17850  United Kingdom
4     536403       1.85       12791     Netherlands

In [232]:
df1.drop("INVOICENO", axis = 1, inplace = True)    # deleting column 'INVOICENO'
df1.head()

   UNITPRICE  CUSTOMERID         COUNTRY
0       2.55       17850  United Kingdom
1       3.39       17850  United Kingdom
2       2.75       17850  United Kingdom
3       3.39       17850  United Kingdom
4       1.85       12791     Netherlands

In [233]:
df1.insert(1, 'TAX', df1.UNITPRICE * 0.10)    # inserting column 'TAX' at index 1
df1.head()

   UNITPRICE    TAX  CUSTOMERID         COUNTRY
0       2.55  0.255       17850  United Kingdom
1       3.39  0.339       17850  United Kingdom
2       2.75  0.275       17850  United Kingdom
3       3.39  0.339       17850  United Kingdom
4       1.85  0.185       12791     Netherlands

In [234]:
df1.COUNTRY

0     United Kingdom
1     United Kingdom
2     United Kingdom
3     United Kingdom
4        Netherlands
5        Netherlands
6          Australia
7          Australia
8          Australia
9          Australia
10            France
11            France
12            France
13            France
14           Germany
Name: COUNTRY, dtype: object

In [235]:
# replacing COUNTRY column values
df1['COUNTRY'].replace({"France":"Fr", "United Kingdom":"UK", "Australia":"Aus", 
                        "Netherlands":"Ned", "Germany":"Gr"}, inplace = True)
df1

    UNITPRICE    TAX  CUSTOMERID COUNTRY
0        2.55  0.255       17850      UK
1        3.39  0.339       17850      UK
2        2.75  0.275       17850      UK
3        3.39  0.339       17850      UK
4        1.85  0.185       12791     Ned
5       15.00  1.500       12791     Ned
6        8.50  0.850       12431     Aus
7        4.95  0.495       12431     Aus
8        1.25  0.125       12431     Aus
9        5.45  0.545       12431     Aus
10       3.75  0.375       12583      Fr
11       3.75  0.375       12583      Fr
12       1.25  0.125       12583      Fr
13       2.95  0.295       12583      Fr
14      18.00  1.800       12662      Gr

In [237]:
df1['COUNTRY'].replace(["Fr", "UK", "Aus", "Ned", "Gr"], ["France", "United Kingdom", 
                            "Australia", "Netherlands", "Germany"], inplace = True)
df1

    UNITPRICE    TAX  CUSTOMERID         COUNTRY
0        2.55  0.255       17850  United Kingdom
1        3.39  0.339       17850  United Kingdom
2        2.75  0.275       17850  United Kingdom
3        3.39  0.339       17850  United Kingdom
4        1.85  0.185       12791     Netherlands
5       15.00  1.500       12791     Netherlands
6        8.50  0.850       12431       Australia
7        4.95  0.495       12431       Australia
8        1.25  0.125       12431       Australia
9        5.45  0.545       12431       Australia
10       3.75  0.375       12583          France
11       3.75  0.375       12583          France
12       1.25  0.125       12583          France
13       2.95  0.295       12583          France
14      18.00  1.800       12662         Germany

In [238]:
# factorizing COUNTRY column values
df1.insert(4, 'COUNTRY_CODE',  pd.factorize(df1['COUNTRY'])[0])
df1

    UNITPRICE    TAX  CUSTOMERID         COUNTRY  COUNTRY_CODE
0        2.55  0.255       17850  United Kingdom             0
1        3.39  0.339       17850  United Kingdom             0
2        2.75  0.275       17850  United Kingdom             0
3        3.39  0.339       17850  United Kingdom             0
4        1.85  0.185       12791     Netherlands             1
5       15.00  1.500       12791     Netherlands             1
6        8.50  0.850       12431       Australia             2
7        4.95  0.495       12431       Australia             2
8        1.25  0.125       12431       Australia             2
9        5.45  0.545       12431       Australia             2
10       3.75  0.375       12583          France             3
11       3.75  0.375       12583          France             3
12       1.25  0.125       12583          France             3
13       2.95  0.295       12583          France             3
14      18.00  1.800       12662         Germany             4